ExprovipFuel/src/InformationRegisters/АвтомобилиКарточек/АвтомобилиКарточек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтомобилиКарточек</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </resources>
  <resources>
    <name>АвтомобильСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Карточка</name>
    <type>
      <types>CatalogRef.Карточки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Enums/МодулиОбмена/МодулиОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МодулиОбмена</name>
  <enumValues>
    <name>БеларусьНефть</name>
  </enumValues>
  <enumValues>
    <name>ТранзитКард</name>
  </enumValues>
  <enumValues>
    <name>Татнефть</name>
  </enumValues>
  <enumValues>
    <name>ТатнефтьРФ</name>
  </enumValues>
  <enumValues>
    <name>ЛукойлБеларусь</name>
  </enumValues>
  <enumValues>
    <name>Белтол</name>
  </enumValues>
  <enumValues>
    <name>Роснефть</name>
  </enumValues>
</mdclass:Enum>

ExprovipFuel/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДороги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИдентификаторыКодовПоставщиков</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий77</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ExprovipFuel/src/CommonModules/ЗагрузкаОбщий/Module.bsl
#Область ПрограммныйИнтерфейс

// Структура строки эксель для загрузки.
// 
// Возвращаемое значение:
//  Структура - Структура строки эксель для загрузки:
// * КартаСтрока - Строка - 
// * Карта - СправочникСсылка.Карточки - 
// * ДатаТранзакции - Дата - 
// * Количество - Число - 
// * ПродуктСтрока - Строка - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Цена - Число - 
// * Сумма - Число - 
// * МестоТранзакцииСтрока - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции
// * МестоТранзакцииАдрес - Строка - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - СправочникСсылка.Автомобили - 
Функция СтруктураСтрокиЭксельДляЗагрузки() Экспорт
	Структура = Новый Структура();
	Структура.Вставить("КартаСтрока", "");
	Структура.Вставить("Карта", Справочники.Карточки.ПустаяСсылка());
	Структура.Вставить("ДатаТранзакции", Дата(1, 1, 1));
	Структура.Вставить("Количество", 0);
	Структура.Вставить("ПродуктСтрока", "");
	Структура.Вставить("Продукт", Справочники.Номенклатура.ПустаяСсылка());
	Структура.Вставить("Цена", 0);
	Структура.Вставить("Сумма", 0);
	Структура.Вставить("МестоТранзакцииСтрока", "");
	Структура.Вставить("МестоТранзакции", Справочники.МестаТранзакции.ПустаяСсылка());
	Структура.Вставить("МестоТранзакцииАдрес", "");
	Структура.Вставить("Клиент", Справочники.Контрагенты.ПустаяСсылка());
	Структура.Вставить("Автомобиль", Справочники.Автомобили.ПустаяСсылка());
		
	Возврат Структура;
КонецФункции

// Структура данных загрузки транзакций.
// 
// Возвращаемое значение:
//  Структура - Структура данных загрузки транзакций:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. СтруктураСтрокиЭксельДляЗагрузки 
Функция СтруктураДанныхЗагрузкиТранзакций() Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);
	
	Возврат СтруктураРезультат;
КонецФункции	

// Соответствие карточек.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие карточек
//@skip-check doc-comment-collection-item-type
Функция СоответствиеКарточек() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Наименование КАК Ключ,
	|	Карточки.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Карточки КАК Карточки";
	
	Соответствие = Новый Соответствие();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(Выборка.Ключ), Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции

// Соответствие мест транзакций.
// 
// Параметры:
//  ПапкаЗаправок - СправочникСсылка.МестаТранзакции
//  РеквизитПоиска - Строка
// 
// Возвращаемое значение:
//  Соответствие - Соответствие мест транзакций
//@skip-check doc-comment-collection-item-type
Функция СоответствиеМестТранзакций(ПапкаЗаправок, РеквизитПоиска = "") Экспорт
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МестаТранзакции.КодУчета КАК Ключ,
		|	МестаТранзакции.Ссылка КАК Значение
		|ИЗ
		|	Справочник.МестаТранзакции КАК МестаТранзакции
		|ГДЕ
		|	МестаТранзакции.Ссылка В ИЕРАРХИИ (&ПапкаЗаправок)
		|	И НЕ МестаТранзакции.ЭтоГруппа
		|	И НЕ МестаТранзакции.ПометкаУдаления";
	Если Не ПустаяСтрока(РеквизитПоиска) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КодУчета", РеквизитПоиска);
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("ПапкаЗаправок", ПапкаЗаправок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(ВыборкаДетальныеЗаписи.Ключ), ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Соответсвие номенклатуры.
// 
// Параметры:
//  ИмяРеквизитаПоиска - Строка - Имя реквизита поиска
// 
// Возвращаемое значение:
//  Соответствие - Соответсвие номенклатуры
//@skip-check doc-comment-collection-item-type
Функция СоответсвиеНоменклатуры(ИмяРеквизитаПоиска) Экспорт
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяРеквизитаПоиска", ИмяРеквизитаПоиска);
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураИдентификаторыКодовПоставщиков.Комментарий77 КАК РеквизитПоиска,
	|	НоменклатураИдентификаторыКодовПоставщиков.ИД КАК Ключ,
	|	НоменклатураИдентификаторыКодовПоставщиков.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ИдентификаторыКодовПоставщиков КАК НоменклатураИдентификаторыКодовПоставщиков
	|ГДЕ
	|	НоменклатураИдентификаторыКодовПоставщиков.Комментарий77 = &ИмяРеквизитаПоиска";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(Выборка.Ключ), Выборка.Значение);
	КонецЦикла;
		
	Возврат Соответствие;	
КонецФункции

// Соответствие владельцев карт.
// 
// Параметры:
//  МассивКарт - Массив из СправочникСсылка.Карточки
// 
// Возвращаемое значение:
//  Соответствие - Соответствие владельцев карт
//@skip-check doc-comment-collection-item-type
Функция СоответствиеВладельцевКарт(МассивКарт) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКарточек", МассивКарт);
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Ссылка КАК Ключ,
	|	Карточки.Владелец КАК Значение
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Ссылка В (&МассивКарточек)";
	
	Соответствие = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции

// Соответствие автомобилей карт.
// 
// Параметры:
//  МассивКарт - Массив из СправочникСсылка.Карточки
// 
// Возвращаемое значение:
//  Соответствие - Соответствие автомобилей карт
//@skip-check doc-comment-collection-item-type
Функция СоответствиеАвтомобилейКарт(МассивКарт) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКарт", МассивКарт);
	Запрос.Текст = "ВЫБРАТЬ
	|	АвтомобилиКарточекСрезПоследних.Карточка КАК Ключ,
	|	АвтомобилиКарточекСрезПоследних.Автомобиль КАК Значение
	|ИЗ
	|	РегистрСведений.АвтомобилиКарточек.СрезПоследних(, Карточка В (&МассивКарт)) КАК АвтомобилиКарточекСрезПоследних";
	
	Соответствие = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции

// Получить модуль загрузки по перечислению.
// 
// Параметры:
//  МодулиОбменаПеречисление - ПеречислениеСсылка.МодулиОбмена - 
// 
// Возвращаемое значение:
//  CommonModule.ЗагрузкаБеларусьнефь - Получить модуль загрузки по перечислению
Функция ПолучитьМодульЗагрузкиПоПеречислению(МодулиОбменаПеречисление) Экспорт
	Если МодулиОбменаПеречисление = Перечисления.МодулиОбмена.БеларусьНефть Тогда
		Возврат ЗагрузкаБеларусьнефь;
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.ТранзитКард Тогда
		Возврат ЗагрузкаТранзитКард;
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.Татнефть Тогда
		Возврат ЗагрузкаТатнефть;
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.ТатнефтьРФ Тогда
		Возврат ЗагрузкаТатнефтьРФ;	
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.ЛукойлБеларусь Тогда
		Возврат ЗагрузкаЛукойлБеларусь;	
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.Белтол Тогда
		Возврат ЗагрузкаБелтол;	
	ИначеЕсли МодулиОбменаПеречисление = Перечисления.МодулиОбмена.Роснефть Тогда
		Возврат ЗагрузкаРоснефть;
	Иначе
		Возврат Неопределено;					
	КонецЕсли;		
КонецФункции	

#КонецОбласти
